#!/bin/bash

# 1. Запрос исходной и целевой директории у пользователя
#gudkova anastasiia
read -p "введите адрес исходной директории"
read -p "введите адресцелевой дирректории"

# 2. Запрос расширения файлов, которые нужно скопировать


# 3. Проверка существования исходной директории


# 4. Проверка существования целевой директории


# 5. Проверка, есть ли файлы с указанным расширением в исходной директории


# 6. Подсчет общего количества файлов в исходной директории



# 7. Копирование файлов с указанным расширением в целевую директорию


# 8 .Подсчет общего количества файлов в целевой директории



